; ModuleID = 'extr_union_vnops.c_unionfs_rename.bc'
source_filename = "extr_union_vnops.c_unionfs_rename.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.vnode = type { i64, i32, i32* }
%struct.thread = type { i32 }
%struct.vop_rename_args = type { %struct.componentname*, %struct.vnode*, %struct.vnode*, %struct.componentname*, %struct.vnode*, %struct.vnode* }
%struct.componentname = type { i32, i32 }
%struct.unionfs_mount = type { i32 }
%struct.unionfs_node = type { %struct.vnode*, %struct.vnode* }

@.str = private unnamed_addr constant [23 x i8] c"unionfs_rename: enter\0A\00", align 1
@NULLVP = common dso_local global %struct.vnode* null, align 8, !dbg !0
@curthread = common dso_local global %struct.thread* null, align 8, !dbg !23
@unionfs_vnodeops = common dso_local global i32 0, align 4, !dbg !29
@ENODEV = common dso_local global i32 0, align 4, !dbg !11
@EXDEV = common dso_local global i32 0, align 4, !dbg !13
@LK_EXCLUSIVE = common dso_local global i32 0, align 4, !dbg !17
@LK_RELEASE = common dso_local global i32 0, align 4, !dbg !19
@DOWHITEOUT = common dso_local global i32 0, align 4, !dbg !6
@EINVAL = common dso_local global i32 0, align 4, !dbg !9
@LK_RETRY = common dso_local global i32 0, align 4, !dbg !21
@.str.1 = private unnamed_addr constant [28 x i8] c"unionfs_rename: leave (%d)\0A\00", align 1
@HASBUF = common dso_local global i32 0, align 4, !dbg !15

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "NULLVP", scope: !2, file: !3, line: 31, type: !31, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.0-2 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5, nameTableKind: None)
!3 = !DIFile(filename: "extr_union_vnops.c_unionfs_rename.c", directory: "/home/anderson/IOSProject/IntelligentOptimizationSelection/Benchmarks/Angha/extr_union_vnops_unionfs_rename")
!4 = !{}
!5 = !{!6, !9, !11, !13, !15, !17, !19, !21, !0, !23, !29}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "DOWHITEOUT", scope: !2, file: !3, line: 21, type: !8, isLocal: false, isDefinition: true)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "EINVAL", scope: !2, file: !3, line: 22, type: !8, isLocal: false, isDefinition: true)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "ENODEV", scope: !2, file: !3, line: 23, type: !8, isLocal: false, isDefinition: true)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "EXDEV", scope: !2, file: !3, line: 24, type: !8, isLocal: false, isDefinition: true)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "HASBUF", scope: !2, file: !3, line: 25, type: !8, isLocal: false, isDefinition: true)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "LK_EXCLUSIVE", scope: !2, file: !3, line: 27, type: !8, isLocal: false, isDefinition: true)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "LK_RELEASE", scope: !2, file: !3, line: 28, type: !8, isLocal: false, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "LK_RETRY", scope: !2, file: !3, line: 29, type: !8, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "curthread", scope: !2, file: !3, line: 39, type: !25, isLocal: false, isDefinition: true)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread", file: !3, line: 17, size: 32, elements: !27)
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !26, file: !3, line: 17, baseType: !8, size: 32)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "unionfs_vnodeops", scope: !2, file: !3, line: 45, type: !8, isLocal: false, isDefinition: true)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vnode", file: !3, line: 14, size: 192, elements: !33)
!33 = !{!34, !37, !38}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "v_mount", scope: !32, file: !3, line: 14, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "scalar_t__", file: !3, line: 4, baseType: !36)
!36 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "v_type", scope: !32, file: !3, line: 14, baseType: !8, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "v_op", scope: !32, file: !3, line: 14, baseType: !39, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!40 = !{i32 2, !"Dwarf Version", i32 4}
!41 = !{i32 2, !"Debug Info Version", i32 3}
!42 = !{i32 1, !"wchar_size", i32 4}
!43 = !{!"clang version 9.0.0-2 (tags/RELEASE_900/final)"}
!44 = distinct !DISubprogram(name: "unionfs_rename", scope: !3, file: !3, line: 52, type: !45, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!45 = !DISubroutineType(types: !46)
!46 = !{!8, !47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vop_rename_args", file: !3, line: 13, size: 384, elements: !49)
!49 = !{!50, !56, !57, !58, !59, !60}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "a_tcnp", scope: !48, file: !3, line: 13, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "componentname", file: !3, line: 18, size: 64, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "cn_flags", scope: !52, file: !3, line: 18, baseType: !8, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "cn_cred", scope: !52, file: !3, line: 18, baseType: !8, size: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "a_tvp", scope: !48, file: !3, line: 13, baseType: !31, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "a_tdvp", scope: !48, file: !3, line: 13, baseType: !31, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "a_fcnp", scope: !48, file: !3, line: 13, baseType: !51, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "a_fvp", scope: !48, file: !3, line: 13, baseType: !31, size: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "a_fdvp", scope: !48, file: !3, line: 13, baseType: !31, size: 64, offset: 320)
!61 = !DILocalVariable(name: "ap", arg: 1, scope: !44, file: !3, line: 52, type: !47)
!62 = !DILocation(line: 52, column: 40, scope: !44)
!63 = !DILocalVariable(name: "error", scope: !44, file: !3, line: 54, type: !8)
!64 = !DILocation(line: 54, column: 7, scope: !44)
!65 = !DILocalVariable(name: "fdvp", scope: !44, file: !3, line: 55, type: !31)
!66 = !DILocation(line: 55, column: 18, scope: !44)
!67 = !DILocalVariable(name: "fvp", scope: !44, file: !3, line: 56, type: !31)
!68 = !DILocation(line: 56, column: 18, scope: !44)
!69 = !DILocalVariable(name: "fcnp", scope: !44, file: !3, line: 57, type: !51)
!70 = !DILocation(line: 57, column: 24, scope: !44)
!71 = !DILocalVariable(name: "tdvp", scope: !44, file: !3, line: 58, type: !31)
!72 = !DILocation(line: 58, column: 18, scope: !44)
!73 = !DILocalVariable(name: "tvp", scope: !44, file: !3, line: 59, type: !31)
!74 = !DILocation(line: 59, column: 18, scope: !44)
!75 = !DILocalVariable(name: "tcnp", scope: !44, file: !3, line: 60, type: !51)
!76 = !DILocation(line: 60, column: 24, scope: !44)
!77 = !DILocalVariable(name: "ltdvp", scope: !44, file: !3, line: 61, type: !31)
!78 = !DILocation(line: 61, column: 18, scope: !44)
!79 = !DILocalVariable(name: "ltvp", scope: !44, file: !3, line: 62, type: !31)
!80 = !DILocation(line: 62, column: 18, scope: !44)
!81 = !DILocalVariable(name: "td", scope: !44, file: !3, line: 63, type: !25)
!82 = !DILocation(line: 63, column: 18, scope: !44)
!83 = !DILocalVariable(name: "rfdvp", scope: !44, file: !3, line: 66, type: !31)
!84 = !DILocation(line: 66, column: 18, scope: !44)
!85 = !DILocalVariable(name: "rfvp", scope: !44, file: !3, line: 67, type: !31)
!86 = !DILocation(line: 67, column: 18, scope: !44)
!87 = !DILocalVariable(name: "rtdvp", scope: !44, file: !3, line: 68, type: !31)
!88 = !DILocation(line: 68, column: 18, scope: !44)
!89 = !DILocalVariable(name: "rtvp", scope: !44, file: !3, line: 69, type: !31)
!90 = !DILocation(line: 69, column: 18, scope: !44)
!91 = !DILocalVariable(name: "needrelookup", scope: !44, file: !3, line: 71, type: !8)
!92 = !DILocation(line: 71, column: 7, scope: !44)
!93 = !DILocalVariable(name: "ump", scope: !44, file: !3, line: 72, type: !94)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unionfs_mount", file: !3, line: 16, size: 32, elements: !96)
!96 = !{!97}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !95, file: !3, line: 16, baseType: !8, size: 32)
!98 = !DILocation(line: 72, column: 24, scope: !44)
!99 = !DILocalVariable(name: "unp", scope: !44, file: !3, line: 73, type: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unionfs_node", file: !3, line: 15, size: 128, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "un_lowervp", scope: !101, file: !3, line: 15, baseType: !31, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "un_uppervp", scope: !101, file: !3, line: 15, baseType: !31, size: 64, offset: 64)
!105 = !DILocation(line: 73, column: 23, scope: !44)
!106 = !DILocation(line: 75, column: 2, scope: !44)
!107 = !DILocation(line: 77, column: 8, scope: !44)
!108 = !DILocation(line: 78, column: 9, scope: !44)
!109 = !DILocation(line: 78, column: 13, scope: !44)
!110 = !DILocation(line: 78, column: 7, scope: !44)
!111 = !DILocation(line: 79, column: 8, scope: !44)
!112 = !DILocation(line: 79, column: 12, scope: !44)
!113 = !DILocation(line: 79, column: 6, scope: !44)
!114 = !DILocation(line: 80, column: 9, scope: !44)
!115 = !DILocation(line: 80, column: 13, scope: !44)
!116 = !DILocation(line: 80, column: 7, scope: !44)
!117 = !DILocation(line: 81, column: 9, scope: !44)
!118 = !DILocation(line: 81, column: 13, scope: !44)
!119 = !DILocation(line: 81, column: 7, scope: !44)
!120 = !DILocation(line: 82, column: 8, scope: !44)
!121 = !DILocation(line: 82, column: 12, scope: !44)
!122 = !DILocation(line: 82, column: 6, scope: !44)
!123 = !DILocation(line: 83, column: 9, scope: !44)
!124 = !DILocation(line: 83, column: 13, scope: !44)
!125 = !DILocation(line: 83, column: 7, scope: !44)
!126 = !DILocation(line: 84, column: 10, scope: !44)
!127 = !DILocation(line: 84, column: 8, scope: !44)
!128 = !DILocation(line: 85, column: 9, scope: !44)
!129 = !DILocation(line: 85, column: 7, scope: !44)
!130 = !DILocation(line: 86, column: 7, scope: !44)
!131 = !DILocation(line: 86, column: 5, scope: !44)
!132 = !DILocation(line: 87, column: 10, scope: !44)
!133 = !DILocation(line: 87, column: 8, scope: !44)
!134 = !DILocation(line: 88, column: 9, scope: !44)
!135 = !DILocation(line: 88, column: 7, scope: !44)
!136 = !DILocation(line: 89, column: 10, scope: !44)
!137 = !DILocation(line: 89, column: 8, scope: !44)
!138 = !DILocation(line: 90, column: 9, scope: !44)
!139 = !DILocation(line: 90, column: 7, scope: !44)
!140 = !DILocation(line: 91, column: 15, scope: !44)
!141 = !DILocation(line: 99, column: 6, scope: !142)
!142 = distinct !DILexicalBlock(scope: !44, file: !3, line: 99, column: 6)
!143 = !DILocation(line: 99, column: 11, scope: !142)
!144 = !DILocation(line: 99, column: 22, scope: !142)
!145 = !DILocation(line: 99, column: 28, scope: !142)
!146 = !DILocation(line: 99, column: 19, scope: !142)
!147 = !DILocation(line: 99, column: 36, scope: !142)
!148 = !DILocation(line: 100, column: 7, scope: !142)
!149 = !DILocation(line: 100, column: 14, scope: !142)
!150 = !DILocation(line: 100, column: 11, scope: !142)
!151 = !DILocation(line: 100, column: 21, scope: !142)
!152 = !DILocation(line: 100, column: 24, scope: !142)
!153 = !DILocation(line: 100, column: 29, scope: !142)
!154 = !DILocation(line: 100, column: 40, scope: !142)
!155 = !DILocation(line: 100, column: 45, scope: !142)
!156 = !DILocation(line: 100, column: 37, scope: !142)
!157 = !DILocation(line: 99, column: 6, scope: !44)
!158 = !DILocation(line: 101, column: 7, scope: !159)
!159 = distinct !DILexicalBlock(scope: !160, file: !3, line: 101, column: 7)
!160 = distinct !DILexicalBlock(scope: !142, file: !3, line: 100, column: 55)
!161 = !DILocation(line: 101, column: 12, scope: !159)
!162 = !DILocation(line: 101, column: 17, scope: !159)
!163 = !DILocation(line: 101, column: 7, scope: !160)
!164 = !DILocation(line: 102, column: 12, scope: !159)
!165 = !DILocation(line: 102, column: 10, scope: !159)
!166 = !DILocation(line: 102, column: 4, scope: !159)
!167 = !DILocation(line: 104, column: 12, scope: !159)
!168 = !DILocation(line: 104, column: 10, scope: !159)
!169 = !DILocation(line: 105, column: 3, scope: !160)
!170 = !DILocation(line: 109, column: 6, scope: !171)
!171 = distinct !DILexicalBlock(scope: !44, file: !3, line: 109, column: 6)
!172 = !DILocation(line: 109, column: 13, scope: !171)
!173 = !DILocation(line: 109, column: 10, scope: !171)
!174 = !DILocation(line: 109, column: 6, scope: !44)
!175 = !DILocation(line: 110, column: 3, scope: !171)
